src/InformationRegisters/ИсторияВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаправлениеВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаправленияВызова</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательSip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРазговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗвонка</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятДругимАбонентомГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбрабатывающего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоллтрекингНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомерСотрудника</Name>
					<Comment>Добавочный номер для ITOOLABSE</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокПолученияФайлаЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыОбработкиЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбработкиЗвонка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОборудованиеТелефонии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияВызовов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Получить по IDЗвонка
//
// Параметры:
//  IDЗвонка - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПоIDЗвонка(IDЗвонка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("IDЗвонка", IDЗвонка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 *
	               |ИЗ
	               |	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	               |ГДЕ
	               |	ИсторияВызовов.IDЗвонка = &IDЗвонка";
				   
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат СтрокуТаблицыЗначенийВСтруктуру(РезультатЗапроса[0], РезультатЗапроса);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить коллтрекинг номер
//
// Параметры:
//  IDЗвонка		 - 	 - 
//  ПОIPТелефонии	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКоллтрекингНомер(IDЗвонка = Неопределено, ПОIPТелефонии = Неопределено, Заявка = Неопределено) Экспорт
	
	СтруктураКоллтрекинга = Новый Структура;
	
	Если IDЗвонка = Неопределено И ПОIPТелефонии = Неопределено И Заявка = Неопределено Тогда 
		СтруктураКоллтрекинга.Вставить("ПОIPТелефонии"		, Неопределено);
		СтруктураКоллтрекинга.Вставить("IDЗвонка"			, "");
		СтруктураКоллтрекинга.Вставить("КоллтрекингНомер"	, "");
		
		Возврат СтруктураКоллтрекинга;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияВызовов.ОборудованиеТелефонии КАК ПОIPТелефонии,
	               |	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
	               |	ИсторияВызовов.КоллтрекингНомер КАК КоллтрекингНомер
	               |ИЗ
	               |	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	               |ГДЕ
	               |	ИсторияВызовов.ОборудованиеТелефонии = &ОборудованиеТелефонии
	               |	И ИсторияВызовов.IDЗвонка = &IDЗвонка
	               |	И ИсторияВызовов.Заявка = &Заявка
	               |	И ИсторияВызовов.КоллтрекингНомер <> """"";
	
	Если НЕ ЗначениеЗаполнено(IDЗвонка) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияВызовов.IDЗвонка = &IDЗвонка", "ИСТИНА");
	Иначе 
		Запрос.УстановитьПараметр("IDЗвонка", IDЗвонка);
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ПОIPТелефонии) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияВызовов.ОборудованиеТелефонии = &ОборудованиеТелефонии", "ИСТИНА");
	Иначе 
		Запрос.УстановитьПараметр("ОборудованиеТелефонии", ПОIPТелефонии);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияВызовов.Заявка = &Заявка", "ИСТИНА");
	Иначе 
		Запрос.УстановитьПараметр("Заявка", Заявка);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("IDЗвонка", IDЗвонка);
	
	ВыборкаКоллтрекингНомер = Запрос.Выполнить().Выбрать();
	Если ВыборкаКоллтрекингНомер.Следующий() Тогда
		СтруктураКоллтрекинга.Вставить("ПОIPТелефонии"		, ВыборкаКоллтрекингНомер.ПОIPТелефонии);
		СтруктураКоллтрекинга.Вставить("IDЗвонка"			, ВыборкаКоллтрекингНомер.IDЗвонка);
		СтруктураКоллтрекинга.Вставить("КоллтрекингНомер"	, ВыборкаКоллтрекингНомер.КоллтрекингНомер);
		
		Возврат СтруктураКоллтрекинга;
	Иначе 
		СтруктураКоллтрекинга.Вставить("ПОIPТелефонии"		, Неопределено);
		СтруктураКоллтрекинга.Вставить("IDЗвонка"			, "");
		СтруктураКоллтрекинга.Вставить("КоллтрекингНомер"	, "");
		
		Возврат СтруктураКоллтрекинга;
	КонецЕсли;	
		
КонецФункции	


#КонецОбласти
